app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at", "completed_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "nkjl"], ["todo_list_id", 1], ["created_at", "2024-05-09 16:46:51.192417"], ["updated_at", "2024-05-09 16:46:51.192417"], ["completed_at", nil]]
---
def create
 @todo_item = @todo_list.todo_items.create(todo_item_params)

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 2], ["id", 13], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 13]]
---
def show
 @todo_item = @todo_list.todo_items.find(params[:id])
 if @todo_item.destroy

UPDATE "todo_items" SET "updated_at" = ?, "completed_at" = ? WHERE "todo_items"."id" = ?  [["updated_at", "2024-05-09 16:28:23.793634"], ["completed_at", "2024-05-09 16:28:23.793104"], ["id", 2]]
---
def complete
 @todo_item.update_attribute(:completed_at, Time.now)